app/views/houses/show.html.erb

        <h2>House Chores</h2>
        <% house.user_house_chores.each do |chore| %>
            <p>Chore: <%= chore.chore.name %></p>
            <p>Mate: <%= chore.user.first_name %></p>
---
SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1  [["house_id", "d09cdd17-f4b9-476e-84a3-2087c7a75a85"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "3e485df6-e6bc-4e33-b9ab-8e4d73da8890"], ["LIMIT", 1]]