app/views/users/show.html.erb

SELECT "mate_reviews".* FROM "mate_reviews" WHERE "mate_reviews"."user_id" = $1  [["user_id", "db7e7b9c-a4f8-470b-9034-a8c79eb77fb0"]]
---

    <% @user.received_reviews.each do |review| %>