app/views/users/show.html.erb

SELECT  "mate_profiles".* FROM "mate_profiles" WHERE "mate_profiles"."user_id" = $1 LIMIT $2  [["user_id", "051417e2-ac7a-4a89-85a7-485fa3127115"], ["LIMIT", 1]]
---
<div>
    <% if @user.profile_pic.present? %>
        <img src="<%= @user.profile_pic.url %>" alt="Good ol' <%= @user.first_name %>" >

SELECT "mate_reviews".* FROM "mate_reviews" WHERE "mate_reviews"."user_id" = $1  [["user_id", "adb77b2d-3cdf-4ed1-9be4-6946915fbb90"]]
---

    <% @user.received_reviews.each do |review| %>