app/helpers/application_helper.rb

    def shared_houses?(other_user)
        my_houses = HouseUser.where(user: current_user).map { |record| record.house_id}
        their_houses = HouseUser.where(user: other_user).map { |record| record.house_id}
---
SELECT "house_users".* FROM "house_users" WHERE "house_users"."user_id" = $1  [["user_id", "adb77b2d-3cdf-4ed1-9be4-6946915fbb90"]]
SELECT "house_users".* FROM "house_users" WHERE "house_users"."user_id" = $1  [["user_id", "7f134147-7df7-4fed-81b6-252873a5c067"]]

    def unreviewed?(other_user)
        reviews = MateReview.where(user: other_user, author: current_user)
        reviews.empty?
---
SELECT  1 AS one FROM "mate_reviews" WHERE "mate_reviews"."user_id" = $1 AND "mate_reviews"."author_id" = $2 LIMIT $3  [["user_id", "7f134147-7df7-4fed-81b6-252873a5c067"], ["author_id", "adb77b2d-3cdf-4ed1-9be4-6946915fbb90"], ["LIMIT", 1]]