app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def authenticated?
        user = User.find_by(id: params[:auth_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "051417e2-ac7a-4a89-85a7-485fa3127115"], ["LIMIT", 1]]
---
    def current_user
        User.find_by(id: params[:auth_id])

SELECT "house_users".* FROM "house_users" WHERE "house_users"."house_id" = $1 AND "house_users"."active" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["active", true]]
---
    def my_house?(house)
        HouseUser.where(user: current_user, house: house, active: true).empty? ? false : true

INSERT INTO "bill_payments" ("user_id", "amount_due", "paid", "active", "house_bill_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def generate_payments!(bill)
        mates = HouseUser.where(house: bill.house, active: true)
        split_payment = bill.amount / mates.length
        mates.each do |mate|
            byebug
            BillPayment.create(
                user: mate,
                amount_due: split_payment,
                paid: false,
                active: true,
                house_bill: bill,
            )