app/controllers/bill_payments_controller.rb

INSERT INTO "bill_payments" ("user_id", "amount_due", "paid", "due_date", "active", "house_bill_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @bill_payment = BillPayment.new(bill_payment_params)

      if @bill_payment.save

UPDATE "bill_payments" SET "paid" = $1, "updated_at" = $2 WHERE "bill_payments"."id" = $3  [["paid", true], ["updated_at", "2018-09-05 01:24:09.018525"], ["id", "e9d40add-9fa7-44df-9355-d5947f23b6ae"]]
---
    def update

      if @bill_payment.update(bill_payment_params)

SELECT  "bill_payments".* FROM "bill_payments" WHERE "bill_payments"."id" = $1 LIMIT $2  [["id", "eedcaae8-a266-4e31-8953-aa82c850ca39"], ["LIMIT", 1]]
---
    def set_bill_payment
      @bill_payment = BillPayment.find(params[:id])