app/controllers/chores_controller.rb

SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT $2  [["id", "2c3823d1-df03-4ed6-898c-ac44b9e916ce"], ["LIMIT", 1]]
---
    def set_chore
      @chore = Chore.find(params[:id])