app/controllers/house_bills_controller.rb

    def create
      @house_bill = HouseBill.new(house_bill_params)

      if @house_bill.save
---
INSERT INTO "house_bills" ("desc", "due_date", "amount", "active", "user_id", "category", "created_at", "updated_at", "house_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def update

      if @house_bill.update(house_bill_params)
        params[:images].each do |img|
            BillImage.create(active: true, house_bill_id: @house_bill.id, image: img )
---
UPDATE "house_bills" SET "desc" = $1, "updated_at" = $2 WHERE "house_bills"."id" = $3  [["desc", "internet"], ["updated_at", "2018-09-05 01:24:09.217761"], ["id", "f3e59134-733f-41f7-9604-085d7f67e8d4"]]
INSERT INTO "bill_images" ("image", "active", "house_bill_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def set_house_bill
      @house_bill = HouseBill.find(params[:id])
---
SELECT  "house_bills".* FROM "house_bills" WHERE "house_bills"."id" = $1 LIMIT $2  [["id", "7de8ba63-fdb9-4c8b-9988-fc0ea351603e"], ["LIMIT", 1]]