app/controllers/houses_controller.rb

INSERT INTO "houses" ("address", "state", "country", "rent_cycle", "rent_start_date", "join_code", "code_expiry_date", "bio", "created_at", "updated_at", "rent") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @house = House.new(house_params)
    if @house.save

UPDATE "houses" SET "bio" = $1, "updated_at" = $2 WHERE "houses"."id" = $3  [["bio", "this house is a nightmare..."], ["updated_at", "2018-09-05 01:24:09.432028"], ["id", "8c065de3-80e5-49e5-ad62-acbdb77f4d64"]]
---
  def update
    if @house.update(house_params)

SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT $2  [["id", "8c065de3-80e5-49e5-ad62-acbdb77f4d64"], ["LIMIT", 1]]
---
  def set_house
    @house = House.find(params[:id] || current_user.houses.first.id)