app/controllers/house_users_controller.rb

  def create
    @house_user = HouseUser.new(house_user_params)

    if @house_user.save
---
INSERT INTO "house_users" ("user_id", "is_admin", "active", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @house_user.update(house_user_params)
---
UPDATE "house_users" SET "active" = $1, "updated_at" = $2 WHERE "house_users"."id" = $3  [["active", false], ["updated_at", "2018-09-05 04:55:37.778837"], ["id", "a63f776d-9615-493b-9a10-ac5dee372b92"]]

  def join_house
    redirect_to '/join_house' if !params[:join_code]
    house = House.where(join_code: params[:join_code]).first
    HouseUser.where(user: current_user).each do |hu|
        hu.active = false
        hu.save
    end
    membership = HouseUser.new(house: house, user:current_user, active:true)
    house.join_code = SecureRandom.hex 4
    house.save
    if membership.save
---
SELECT "house_users".* FROM "house_users" WHERE "house_users"."user_id" = $1  [["user_id", "7f134147-7df7-4fed-81b6-252873a5c067"]]
UPDATE "houses" SET "join_code" = $1, "updated_at" = $2 WHERE "houses"."id" = $3  [["join_code", "964f8a5e"], ["updated_at", "2018-09-05 05:01:06.703840"], ["id", "f311a1f6-1e1b-404b-895d-20f05972d699"]]
INSERT INTO "house_users" ("user_id", "active", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def set_house_user
    @house_user = HouseUser.find(params[:id])
---
SELECT "house_users".* FROM "house_users" WHERE "house_users"."user_id" = $1  [["user_id", "adb77b2d-3cdf-4ed1-9be4-6946915fbb90"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "adb77b2d-3cdf-4ed1-9be4-6946915fbb90"], ["LIMIT", 1]]