app/controllers/mate_reviews_controller.rb

  def create
    if current_user.id == params[:user_id]
      redirect_to '/my_profile' and return
    end

    @mate_review = MateReview.new(mate_review_params)
    @mate_review.author_id = current_user.id
    if @mate_review.save
---
INSERT INTO "mate_reviews" ("rating", "comment", "author_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if current_user.id != @mate_review.author_id
      render deny! and return
    end
    if @mate_review.update(mate_review_params)
---
UPDATE "mate_reviews" SET "rating" = $1, "updated_at" = $2 WHERE "mate_reviews"."id" = $3  [["rating", "3.7"], ["updated_at", "2018-09-05 01:24:09.678721"], ["id", 4]]

  def set_mate_review
    @mate_review = MateReview.find(params[:id])
---
SELECT  "mate_reviews".* FROM "mate_reviews" WHERE "mate_reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]