app/controllers/mate_profiles_controller.rb

UPDATE "mate_profiles" SET "marital_status" = $1, "job" = $2, "faith" = $3, "personality" = $4, "updated_at" = $5 WHERE "mate_profiles"."id" = $6  [["marital_status", "very lonely"], ["job", "web dev"], ["faith", "doritos"], ["personality", "lame"], ["updated_at", "2018-09-05 03:32:43.792656"], ["id", "dbb4e002-60ca-4c08-9fcc-84aeba4aee33"]]
---
  def update
    if current_user.id != @mate_profile.user_id
      redirect_to '/my_profile' and return
    end
    if @mate_profile.update(mate_profile_params)

SELECT  "mate_profiles".* FROM "mate_profiles" WHERE "mate_profiles"."id" = $1 LIMIT $2  [["id", "b53f21ad-307a-47d9-b9bc-6749fd107359"], ["LIMIT", 1]]
---
  def set_mate_profile
    @mate_profile = MateProfile.find(params[:id])