app/controllers/user_house_chores_controller.rb

SELECT "chores".* FROM "chores" WHERE "chores"."active" = $1  [["active", true]]
---
    def new
        @house = current_user.houses.first
        @house_mates = @house.users
        @chores = Chore.where(active: true)