app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "son@email.com"], ["LIMIT", 1]]
---
  def new_session
    user = User.find_by(email: params[:email].to_s.downcase)