app/controllers/user_pets_controller.rb

INSERT INTO "user_pets" ("name", "species", "size", "people_friendly", "child_friendly", "pet_friendly", "active", "bio", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create

    if current_user.id != user_pet_params[:user_id]
      render deny! and return
    end
    @user_pet = UserPet.new(user_pet_params)

    if @user_pet.save

UPDATE "user_pets" SET "species" = $1, "bio" = $2, "updated_at" = $3 WHERE "user_pets"."id" = $4  [["species", "cat"], ["bio", "grumpy old man dog"], ["updated_at", "2018-09-05 01:24:09.931789"], ["id", "f667ec79-ede0-4840-a238-125fd1c6b393"]]
---
  def update
    if current_user.id != @user_pet.user_id
      render deny! and return
    end
    if @user_pet.update(user_pet_params)

SELECT  "user_pets".* FROM "user_pets" WHERE "user_pets"."id" = $1 LIMIT $2  [["id", "b4e50f1f-c94c-4ec6-8f29-7967fbb32706"], ["LIMIT", 1]]
---
  def set_user_pet
    @user_pet = UserPet.find(params[:id])