app/controllers/user_house_chores_controller.rb

    def create
      @user_house_chore = UserHouseChore.new(user_house_chore_params)

      if @user_house_chore.save
---
INSERT INTO "user_house_chores" ("house_id", "user_id", "chore_id", "day_of_week", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def set_user_house_chore
      @user_house_chore = UserHouseChore.find(params[:id])
---
SELECT  "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."id" = $1 LIMIT $2  [["id", "3e0b5c4d-af16-4da2-a485-2d6c7db5855d"], ["LIMIT", 1]]
SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT $2  [["id", "6d9b3c30-8952-4786-8fbc-de4d2861fefb"], ["LIMIT", 1]]