app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
      MateProfile.create(user: @user)
---
INSERT INTO "users" ("first_name", "last_name", "username", "dob", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "mate_profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", "0c8cf979-907c-45be-a8a0-06abacd105c4"], ["created_at", "2018-09-05 03:23:26.447467"], ["updated_at", "2018-09-05 03:23:26.447467"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "profile_pic" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["profile_pic", "Screen_Shot_2018-08-28_at_11.01.20_am.png"], ["updated_at", "2018-09-05 11:21:02.115866"], ["id", "db7e7b9c-a4f8-470b-9034-a8c79eb77fb0"]]

  def my_profile

    @user = User.find(params[:auth_id])
    @profile = MateProfile.where(user: @user).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "051417e2-ac7a-4a89-85a7-485fa3127115"], ["LIMIT", 1]]
SELECT  "mate_profiles".* FROM "mate_profiles" WHERE "mate_profiles"."user_id" = $1 LIMIT $2  [["user_id", "051417e2-ac7a-4a89-85a7-485fa3127115"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

  def login
    user = User.find_by(email: params[:email].to_s.downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]