app/views/houses/partials/_bills_all.html.erb

    <h2>Bills - history</h2>
    <% house.house_bills.each do |bill| %>
---
SELECT "house_bills".* FROM "house_bills" WHERE "house_bills"."house_id" = $1  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"]]

                    <li>
                        <%= payment.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "b36a57a8-1ca6-416e-95bc-4d0b1041c2ed"], ["LIMIT", 1]]