app/views/houses/partials/_bills_owing.html.erb

                    <li>
                        <%= payment.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "b36a57a8-1ca6-416e-95bc-4d0b1041c2ed"], ["LIMIT", 1]]