app/views/houses/partials/_chores.html.erb

SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1 AND "user_house_chores"."day_of_week" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["day_of_week", "monday"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "3e485df6-e6bc-4e33-b9ab-8e4d73da8890"], ["LIMIT", 1]]
---
            <h3>Monday</h3>
            <% house.user_house_chores.where(day_of_week: "monday").each do |chore| %>
                <p>Chore: <%= chore.chore.name %></p>
                <p>Mate: <%= chore.user.first_name %></p>

SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1 AND "user_house_chores"."day_of_week" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["day_of_week", "tuesday"]]
---
            <h3>Tuesday</h3>
            <% house.user_house_chores.where(day_of_week: "tuesday").each do |chore| %>

SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1 AND "user_house_chores"."day_of_week" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["day_of_week", "wednesday"]]
---
            <h3>Wednesday</h3>
            <% house.user_house_chores.where(day_of_week: "wednesday").each do |chore| %>

SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1 AND "user_house_chores"."day_of_week" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["day_of_week", "thursday"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "c79e9512-a2c8-431c-a41e-1f046a288c19"], ["LIMIT", 1]]
---
            <h3>Thursday</h3>
            <% house.user_house_chores.where(day_of_week: "thursday").each do |chore| %>
                <p>Chore: <%= chore.chore.name %></p>
                <p>Mate: <%= chore.user.first_name %></p>

SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1 AND "user_house_chores"."day_of_week" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["day_of_week", "friday"]]
---
            <h3>Friday</h3>
            <% house.user_house_chores.where(day_of_week: "friday").each do |chore| %>

SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1 AND "user_house_chores"."day_of_week" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["day_of_week", "saturday"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "b36a57a8-1ca6-416e-95bc-4d0b1041c2ed"], ["LIMIT", 1]]
---
            <h3>Saturday</h3>
            <% house.user_house_chores.where(day_of_week: "saturday").each do |chore| %>
                <p>Chore: <%= chore.chore.name %></p>
                <p>Mate: <%= chore.user.first_name %></p>

SELECT "user_house_chores".* FROM "user_house_chores" WHERE "user_house_chores"."house_id" = $1 AND "user_house_chores"."day_of_week" = $2  [["house_id", "1e200351-e7f7-4cbe-a90f-bbbf36bfbfb9"], ["day_of_week", "sunday"]]
---
            <h3>Sunday</h3>
            <% house.user_house_chores.where(day_of_week: "sunday").each do |chore| %>