app/views/house_bills/edit.html.erb

SELECT "bill_images".* FROM "bill_images" WHERE "bill_images"."house_bill_id" = $1  [["house_bill_id", "7de8ba63-fdb9-4c8b-9988-fc0ea351603e"]]
---
 <h2>Edit Bill</h2>
    <% @house_bill.bill_images.each do |img| %>